src/cf/InformationRegisters/ФайлыУчаствующиеВЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ФайлыУчаствующиеВЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументЭДО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументВходящийЭДО</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументИсходящийЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидФайла</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыФайловЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВерсияФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыФайловЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыФайловЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтправленныйФайл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФайлСтаройКонцепции</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/ФайлыУчаствующиеВЭДО/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Добавляет файл в регистр.
//
// Параметры:                    
//  ВерсияФайла - СправочникССылка.ВерсииФайлов
//  ДокументЭДО - ДокументССылка.ЭлектронныйДокументВходящийЭДО, ДокументССылка.ЭлектронныйДокументИсходящийЭДО
//  Файл - СправочникССылка.Файлы
//
Процедура ДобавитьОтправленныйФайл(ВерсияФайла, ДокументЭДО, Файл) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВерсияФайла.Установить(ВерсияФайла);
	
	Запись = НаборЗаписей.Добавить();
	Запись.ВерсияФайла = ВерсияФайла;
	Запись.ДокументЭДО = ДокументЭДО;
	Запись.Файл = Файл;
	Запись.ВидФайла = Перечисления.ВидыФайловЭДО.ОтправленныйФайл;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Есть ли запись в РС по файлу
//
//
// Параметры:
//  Файл - СправочникССылка.Файлы
//
// Возвращаемое значение:
//   Булево
//
Функция ФайлОтправленПоЭДО(Файл) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ФайлыОтправленныеПоЭДО.Файл КАК Файл
		|ИЗ
		|	РегистрСведений.ФайлыУчаствующиеВЭДО КАК ФайлыОтправленныеПоЭДО
		|ГДЕ
		|	ФайлыОтправленныеПоЭДО.Файл = &Файл
		|	И ФайлыОтправленныеПоЭДО.ВидФайла = ЗНАЧЕНИЕ(Перечисление.ВидыФайловЭДО.ОтправленныйФайл)";
		
	Запрос.УстановитьПараметр("Файл", Файл);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Вернет запись  - файл - в РС по документу ЭДО
//
//
// Параметры:
//  ДокументЭДО - ДокументССылка.ЭлектронныйДокументВходящийЭДО, ДокументССылка.ЭлектронныйДокументИсходящийЭДО -
//
// Возвращаемое значение:
//   СправочникССылка.Файлы, Неопределено -
//
Функция ОтправленныйФайлПоДокументуЭДО(ДокументЭДО) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ФайлыОтправленныеПоЭДО.Файл КАК Файл
		|ИЗ
		|	РегистрСведений.ФайлыУчаствующиеВЭДО КАК ФайлыОтправленныеПоЭДО
		|ГДЕ
		|	ФайлыОтправленныеПоЭДО.ДокументЭДО = &ДокументЭДО
		|	И ФайлыОтправленныеПоЭДО.ВидФайла = ЗНАЧЕНИЕ(Перечисление.ВидыФайловЭДО.ОтправленныйФайл)";
		
	Запрос.УстановитьПараметр("ДокументЭДО", ДокументЭДО);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Файл;
	КонецЕсли;	
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли
